Билет03/Documents/УстановитьУчетнуюПолитику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>УстановитьУчетнуюПолитику</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
				<xr:Item>InformationRegister.УчетнаяПолитика</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МетодСписания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетодСписания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Билет03/InformationRegisters/УчетнаяПолитика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>УчетнаяПолитика</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МетодСписанияТоваров</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетодСписания</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Билет03/AccumulationRegisters/ОстаткиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановитьУчетнуюПолитику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Билет03/Enums/МетодСписания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>МетодСписания</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>FIFO</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСредней</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Билет03/Documents/УстановитьУчетнуюПолитику/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр УчетнаяПолитика
	Движения.УчетнаяПолитика.Очистить();
	Движения.УчетнаяПолитика.Записывать = Истина;
	Движение = Движения.УчетнаяПолитика.Добавить();
	Движение.Период = Дата;
	Движение.МетодСписанияТоваров = МетодСписания;
	
	Если МетодСписания = Перечисления.МетодСписания.ПоСредней Тогда
		// заблокироуем РН Остатки, получим их и спишем все партии и оприходуем с партией этот документ
		Движения.ОстаткиТоваров.Очистить();
		Движения.ОстаткиТоваров.БлокироватьДляИзменения	= Истина;
		Движения.ОстаткиТоваров.Записывать	= Истина;
		
		//----------- Блокировка --------------------
		Блокировка			= Новый БлокировкаДанных;
		ЭлБлокировки		= Блокировка.Добавить("РегистрНакопления.ОстаткиТоваров");
		ЭлБлокировки.Режим	= РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		//-------------------------------------------
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиТоваровОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиТоваровОстатки.Партия КАК Партия,
		|	ОстаткиТоваровОстатки.КоличествоОстаток КАК Количество,
		|	ОстаткиТоваровОстатки.СуммаОстаток КАК Сумма
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров.Остатки(&МоментВремени, ) КАК ОстаткиТоваровОстатки";
		
		Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка	= РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Движение		= Движения.ОстаткиТоваров.ДобавитьРасход();
			ЗаполнитьЗначенияСвойств(Движение, Выборка);
			Движение.Период	= Дата;

			Движение		= Движения.ОстаткиТоваров.ДобавитьПриход();
			ЗаполнитьЗначенияСвойств(Движение, Выборка);
			Движение.Партия	= Ссылка;
			Движение.Период	= Дата;
		КонецЦикла;
	
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Дата	= НачалоМесяца(Дата);
КонецПроцедуры
